rails_projects/myFirstRoR/app/controllers/pages_controller.rb

INSERT INTO "pages" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Game"], ["description", "Spiderman"], ["created_at", "2016-04-30 13:42:00.866885"], ["updated_at", "2016-04-30 13:42:00.866885"]]
---
  def create
    @page = Page.new(page_params)

    if @page.save

DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]
---
  def destroy
    if @page.destroy

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_page
    @page = Page.find(params[:id])